{"modelTopology": {"keras_version": "2.1.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "int32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": false, "batch_input_shape": [null, 30], "dtype": "float32", "input_dim": 34360, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 30}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, 30], "dtype": "float32", "input_dim": 34360, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 30}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 6, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.3, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "bidirectional_2", "class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 6, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.3, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": 1}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["bidirectional_2", 0, 0, {}]]]}, {"name": "conv1d_6", "class_name": "Conv1D", "config": {"name": "conv1d_6", "trainable": true, "filters": 12, "kernel_size": [4], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "conv1d_7", "class_name": "Conv1D", "config": {"name": "conv1d_7", "trainable": true, "filters": 12, "kernel_size": [4], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "conv1d_8", "class_name": "Conv1D", "config": {"name": "conv1d_8", "trainable": true, "filters": 12, "kernel_size": [3], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "conv1d_9", "class_name": "Conv1D", "config": {"name": "conv1d_9", "trainable": true, "filters": 12, "kernel_size": [3], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "conv1d_10", "class_name": "Conv1D", "config": {"name": "conv1d_10", "trainable": true, "filters": 12, "kernel_size": [2], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "conv1d_11", "class_name": "Conv1D", "config": {"name": "conv1d_11", "trainable": true, "filters": 12, "kernel_size": [2], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "conv1d_4", "class_name": "Conv1D", "config": {"name": "conv1d_4", "trainable": true, "filters": 24, "kernel_size": [6], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "conv1d_3", "class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "filters": 24, "kernel_size": [5], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "conv1d_5", "class_name": "Conv1D", "config": {"name": "conv1d_5", "trainable": true, "filters": 24, "kernel_size": [8], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "conv1d_1", "class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "filters": 24, "kernel_size": [2], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "conv1d_2", "class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "filters": 24, "kernel_size": [3], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1d_6", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]]}, {"name": "dropout_8", "class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1d_8", 0, 0, {}]]]}, {"name": "dropout_9", "class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1d_9", 0, 0, {}]]]}, {"name": "dropout_10", "class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1d_10", 0, 0, {}]]]}, {"name": "dropout_11", "class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1d_11", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": 1}, "inbound_nodes": [[["dropout_6", 0, 0, {}], ["dropout_7", 0, 0, {}], ["dropout_8", 0, 0, {}], ["dropout_9", 0, 0, {}], ["dropout_10", 0, 0, {}], ["dropout_11", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": 1}, "inbound_nodes": [[["dropout_4", 0, 0, {}], ["dropout_3", 0, 0, {}], ["dropout_5", 0, 0, {}], ["dropout_1", 0, 0, {}], ["dropout_2", 0, 0, {}]]]}, {"name": "bidirectional_3", "class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 12, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.3, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "concatenate_5", "class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_2", 0, 0, {}], ["bidirectional_3", 0, 0, {}]]]}, {"name": "max_pooling1d_2", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "strides": [4], "pool_size": [4], "padding": "valid"}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"name": "dropout_13", "class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"name": "flatten_2", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 26, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 13, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_4", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adadelta", "config": {"lr": 0.8999999761581421, "rho": 0.95, "decay": 0.0020000000949949026, "epsilon": 1e-07}}, "loss": "categorical_crossentropy", "metrics": ["acc"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "bidirectional_1/forward_lstm_1/kernel", "shape": [200, 24], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "shape": [6, 24], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/bias", "shape": [24], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/kernel", "shape": [200, 24], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "shape": [6, 24], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "bidirectional_2/forward_lstm_2/kernel", "shape": [200, 24], "dtype": "float32"}, {"name": "bidirectional_2/forward_lstm_2/recurrent_kernel", "shape": [6, 24], "dtype": "float32"}, {"name": "bidirectional_2/forward_lstm_2/bias", "shape": [24], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/kernel", "shape": [200, 24], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/recurrent_kernel", "shape": [6, 24], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "bidirectional_3/forward_lstm_3/kernel", "shape": [12, 48], "dtype": "float32"}, {"name": "bidirectional_3/forward_lstm_3/recurrent_kernel", "shape": [12, 48], "dtype": "float32"}, {"name": "bidirectional_3/forward_lstm_3/bias", "shape": [48], "dtype": "float32"}, {"name": "bidirectional_3/backward_lstm_3/kernel", "shape": [12, 48], "dtype": "float32"}, {"name": "bidirectional_3/backward_lstm_3/recurrent_kernel", "shape": [12, 48], "dtype": "float32"}, {"name": "bidirectional_3/backward_lstm_3/bias", "shape": [48], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "conv1d_1/kernel", "shape": [2, 12, 24], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "conv1d_10/kernel", "shape": [2, 200, 12], "dtype": "float32"}, {"name": "conv1d_10/bias", "shape": [12], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "conv1d_11/kernel", "shape": [2, 200, 12], "dtype": "float32"}, {"name": "conv1d_11/bias", "shape": [12], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "conv1d_2/kernel", "shape": [3, 12, 24], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "conv1d_3/kernel", "shape": [5, 12, 24], "dtype": "float32"}, {"name": "conv1d_3/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "conv1d_4/kernel", "shape": [6, 12, 24], "dtype": "float32"}, {"name": "conv1d_4/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "conv1d_5/kernel", "shape": [8, 12, 24], "dtype": "float32"}, {"name": "conv1d_5/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "conv1d_6/kernel", "shape": [4, 200, 12], "dtype": "float32"}, {"name": "conv1d_6/bias", "shape": [12], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "conv1d_7/kernel", "shape": [4, 200, 12], "dtype": "float32"}, {"name": "conv1d_7/bias", "shape": [12], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "conv1d_8/kernel", "shape": [3, 200, 12], "dtype": "float32"}, {"name": "conv1d_8/bias", "shape": [12], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "conv1d_9/kernel", "shape": [3, 200, 12], "dtype": "float32"}, {"name": "conv1d_9/bias", "shape": [12], "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "dense_3/kernel", "shape": [2688, 26], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [26], "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "dense_4/kernel", "shape": [26, 13], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [13], "dtype": "float32"}]}, {"paths": ["group17-shard1of7", "group17-shard2of7", "group17-shard3of7", "group17-shard4of7", "group17-shard5of7", "group17-shard6of7", "group17-shard7of7"], "weights": [{"name": "embedding_1/embeddings", "shape": [34360, 200], "dtype": "float32"}]}, {"paths": ["group18-shard1of7", "group18-shard2of7", "group18-shard3of7", "group18-shard4of7", "group18-shard5of7", "group18-shard6of7", "group18-shard7of7"], "weights": [{"name": "embedding_2/embeddings", "shape": [34360, 200], "dtype": "float32"}]}]}